<?php

	if ( ! defined( 'ABSPATH' ) ) {
		exit;
	}

	use Carbon_Fields\Block;
	use Carbon_Fields\Field;

	add_action( 'carbon_fields_register_fields', 'sudus_page_price' );

	function sudus_page_price(){
		Block::make(  __('Operation price') )
		     ->add_fields( array(
			     Field::make_text('page_price_block_title', 'Заголовок блоку'),
			     Field::make_complex('page_price_list', 'Перелік розцінок')
			          ->add_fields(array(
				          Field::make_text('name', 'Назва послуги'),
				          Field::make_text('price', 'Ціна послуги'),
			          )),
			     Field::make_rich_text('page_price_text', 'Пояснювальний текст'),
			     Field::make_file('page_price_file', 'Файл з прайсом для завантаження')


		     ) )

		     ->set_category( 'sudus-custom-category')
		     ->set_render_callback( function ( $fields, $attributes, $inner_blocks ) {

			     ?>

			     <!-- Вартість операції -->
			     <section class="operation-price indent-top-big indent-bottom-big animation-tracking">
				     <div class="container">
					     <div class="row first-up">
						     <h2 class="block-title col-12 larg-margin text-center"><?php echo $fields['page_price_block_title'];?></h2>
					     </div>
					     <?php if( $fields['page_price_list'] ):?>
						     <div class="row second-up">
							     <?php foreach( $fields['page_price_list'] as $item ):?>
								     <p class="price-item col-xl-8 offset-xl-2 col-lg-10 offset-lg-1 col-12">
									     <span class="inner">
										     <span class="name"><?php echo $item['name'];?></span>
										     <span class="price"><?php echo $item['price'];?></span>
									     </span>
								     </p>
							     <?php endforeach;?>
						     </div>
					     <?php endif;?>
					     <?php if( $fields['page_price_text'] ):?>
						     <div class="row third-up">
							     <div class="text col-xl-10 offset-xl-1 col-12"><?php echo wpautop($fields['page_price_text']);?></div>
						     </div>
					     <?php endif;?>
					     <?php if( $fields['page_price_file'] ):?>
						     <div class="row">
							     <div class="col-12 content-btn-price">
								     <a href="<?php echo $fields['page_price_file'];?>" download="" class="button blue-btn">
									     <svg xmlns="http://www.w3.org/2000/svg" width="25" height="25" viewBox="0 0 25 25" fill="none">
										     <path d="M23.214 16.0713C22.7209 16.0713 22.3211 16.471 22.3211 16.9642V22.3213C22.3211 22.8144 21.9214 23.2142 21.4283 23.2142H3.5712C3.07807 23.2142 2.67833 22.8144 2.67833 22.3213V16.9642C2.67833 16.471 2.27858 16.0713 1.78545 16.0713C1.29232 16.0713 0.892578 16.471 0.892578 16.9642V22.3213C0.892578 23.8006 2.09181 24.9999 3.57115 24.9999H21.4283C22.9076 24.9999 24.1069 23.8006 24.1069 22.3213V16.9642C24.1069 16.471 23.7071 16.0713 23.214 16.0713Z" fill="white"/>
										     <path d="M17.5759 15.4402C17.2299 15.106 16.6813 15.106 16.3354 15.4402L13.3934 18.3803V0.892874C13.3934 0.399745 12.9936 0 12.5005 0C12.0074 0 11.6076 0.399745 11.6076 0.892874V18.3804L8.66743 15.4402C8.31273 15.0976 7.74751 15.1074 7.40494 15.4621C7.07075 15.8081 7.07075 16.3566 7.40494 16.7027L11.8692 21.1669C12.2175 21.516 12.7828 21.5168 13.1319 21.1685C13.1324 21.168 13.1329 21.1675 13.1335 21.1669L17.5978 16.7027C17.9404 16.348 17.9306 15.7827 17.5759 15.4402Z" fill="white"/>
									     </svg>
									     Завантажити прайс
								     </a>
								     <svg class="pic" xmlns="http://www.w3.org/2000/svg" width="582" height="215" viewBox="0 0 582 215" fill="none">
									     <path d="M582 135.2H339.855C339.755 135.2 339.655 135.2 339.555 135.2C338.755 135.4 337.855 135.5 337.055 135.4C332.355 135.1 329.355 131.1 325.855 126.4C322.455 121.8 318.555 116.6 312.355 115C308.855 114.1 304.855 114.3 301.155 115.8C295.555 117.9 292.055 122.6 289.055 126.7C285.855 131 283.055 134.7 278.455 135.2C277.755 135.3 277.055 135.3 276.355 135.2H276.255H244.455C242.955 135 241.555 135.1 240.155 135.5C224.255 139.6 221.955 177 220.655 199.4C220.455 202.4 220.255 205.4 220.055 207.8C217.555 193.9 213.955 150.6 210.755 111.8C208.555 84.8 206.255 56.9 204.055 36.1C200.555 0 199.055 0 197.155 0C194.055 0 192.655 7.5 187.055 80.6C184.055 118.8 180.055 170.3 176.655 178.8C176.055 177.1 175.355 173.7 174.755 170.7C172.055 157.8 168.055 138.3 156.055 135.5C154.755 135.2 153.355 135.1 152.155 135.2H132.655C132.555 135.2 132.555 135.2 132.455 135.2C131.855 135.3 131.255 135.3 130.755 135.2C128.355 134.8 126.855 132.9 125.155 130.7C123.455 128.5 121.455 125.9 118.155 124.7C115.355 123.6 112.855 124 111.655 124.1C107.155 124.7 104.355 127.2 101.655 129.6C99.0549 131.9 96.5549 134.1 92.6549 134.9C91.3549 135.2 89.9549 135.2 88.3549 135.1H-445C-445.8 135.1 -445 135.7 -445 136.5C-445 137.3 -445.8 137.9 -445 137.9H88.2549C89.955 138 91.5549 138 93.2549 137.6C97.955 136.7 100.955 134 103.555 131.6C106.155 129.3 108.455 127.2 112.055 126.8C113.055 126.7 114.955 126.4 117.155 127.2C119.655 128.2 121.255 130.2 122.955 132.3C124.855 134.8 126.855 137.3 130.455 137.9C131.255 138 132.055 138 132.855 137.9H152.355C153.455 137.8 154.455 137.9 155.455 138.1C165.655 140.5 169.655 159.6 171.955 171C173.555 179 174.255 182.3 176.655 182.3C181.155 182.3 183.555 164.1 189.955 80.6C192.355 49.2 195.155 14.1 197.255 4.6C200.155 16.5 204.455 69 208.055 111.9C215.855 205.8 217.255 214.6 220.555 214.5C222.655 214.4 222.855 212.3 223.655 199.3C224.855 179.1 227.155 141.6 241.055 138C242.055 137.7 243.255 137.7 244.355 137.8C244.455 137.8 244.455 137.8 244.555 137.8H276.355C277.255 137.9 278.155 137.9 278.955 137.8C284.755 137.2 288.255 132.6 291.555 128.1C294.455 124.2 297.555 120.1 302.355 118.2C305.555 117 308.855 116.7 311.755 117.5C316.955 118.9 320.355 123.5 323.655 127.9C327.255 132.7 330.955 137.7 336.955 138C337.955 138.1 339.055 138 340.055 137.8H581.5L582 135.2Z" fill="#FF7152"/>
								     </svg>
							     </div>
						     </div>
					     <?php endif;?>
				     </div>
			     </section>

			     <?php
		     } );
	}




